In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("Bengaluru_House_Data.csv")

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df.shape

(13320, 9)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [6]:
df.drop(columns=["area_type", "availability","society","balcony"], inplace=True)

In [7]:
df

                       location       size total_sqft  bath   price
0      Electronic City Phase II      2 BHK       1056   2.0   39.07
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2                   Uttarahalli      3 BHK       1440   2.0   62.00
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                      Kothanur      2 BHK       1200   2.0   51.00
...                         ...        ...        ...   ...     ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00
13316             Richards Town      4 BHK       3600   5.0  400.00
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00
13319              Doddathoguru      1 BHK        550   1.0   17.00

[13320 rows x 5 columns]

In [8]:
df.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [9]:
df["location"].value_counts()

location
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
3rd Stage Raja Rajeshwari Nagar      1
Chuchangatta Colony                  1
Electronic City Phase 1,             1
Chikbasavanapura                     1
Abshot Layout                        1
Name: count, Length: 1305, dtype: int64

In [10]:
df["location"] = df["location"].fillna("Sarjapur  Road")

In [11]:
df["size"].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
14 BHK           1
12 Bedroom       1
13 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [12]:
df["size"]=df["size"].fillna("2 BHK")

In [13]:
df["bath"].value_counts()

bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
27.0       1
14.0       1
40.0       1
15.0       1
18.0       1
Name: count, dtype: int64

In [14]:
df["bath"] = df["bath"].fillna("mean")

In [15]:
df.isna().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  object
 4   price       13320 non-null  float64
dtypes: float64(1), object(4)
memory usage: 520.4+ KB

In [17]:
df["bhk"] = df["size"].str.split().str.get(0).astype(int)

In [18]:
df[df.bhk >20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [19]:
df["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      shape=(2117,), dtype=object)

In [20]:
def ConvertRange(x):
    temp = x.split("-")
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1])//2)
    try:
        return float(x)
    except:
        return None

In [21]:
df["total_sqft"] = df["total_sqft"].apply(ConvertRange)

In [22]:
df.sample(5)

                 location       size  total_sqft  bath  price  bhk
1979          Hongasandra  8 Bedroom       990.0  12.0  120.0    8
12811        Choodasandra      2 BHK      1115.0   2.0   50.0    2
9660       Varsova Layout      2 BHK      1088.0   2.0   43.5    2
13037         Uttarahalli  3 Bedroom      1650.0   2.0  130.0    3
1901   7th Phase JP Nagar      3 BHK      1300.0   2.0   52.0    3

In [23]:
df["price per sqr feet"] = df["price"]*100000 / df["total_sqft"]

In [24]:
df.head()

,location,size,total_sqft,bath,price,bhk,price per sqr feet
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [25]:
df.describe()

         total_sqft         price           bhk  price per sqr feet
count  13274.000000  13320.000000  13320.000000        1.327400e+04
mean    1572.223365    112.565627      2.802778        7.883259e+03
std     1254.820933    148.971674      1.294496        1.064303e+05
min        1.000000      8.000000      1.000000        2.678298e+02
25%     1100.000000     50.000000      2.000000        4.227642e+03
50%     1280.000000     72.000000      3.000000        5.416667e+03
75%     1690.000000    120.000000      3.000000        7.293505e+03
max    52272.000000   3600.000000     43.000000        1.200000e+07

In [26]:
df["location"]= df["location"].apply(lambda x: x.strip())

In [27]:
df.head()

,location,size,total_sqft,bath,price,bhk,price per sqr feet
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [28]:
df["location"].value_counts()

location
Whitefield                              541
Sarjapur  Road                          400
Electronic City                         304
Kanakpura Road                          273
Thanisandra                             237
                                       ...
Duddanahalli                              1
Doddanakunte                              1
Jogupalya                                 1
Subhash Nagar                             1
Kengeri Satellite Town KHB Apartment      1
Name: count, Length: 1294, dtype: int64

In [29]:
location_count = df["location"].value_counts()

In [30]:
location_count = location_count[location_count<=10]
location_count

location
Basapura                                10
Dairy Circle                            10
Nagappa Reddy Layout                    10
Naganathapura                           10
Sector 1 HSR Layout                     10
                                        ..
Duddanahalli                             1
Doddanakunte                             1
Jogupalya                                1
Subhash Nagar                            1
Kengeri Satellite Town KHB Apartment     1
Name: count, Length: 1053, dtype: int64

In [31]:
df['location'] = df['location'].apply(lambda x: "others" if x in location_count else x)

In [32]:
df["location"].value_counts()

location
others                       2885
Whitefield                    541
Sarjapur  Road                400
Electronic City               304
Kanakpura Road                273
                             ...
Tindlu                         11
Marsur                         11
2nd Phase Judicial Layout      11
Thyagaraja Nagar               11
HAL 2nd Stage                  11
Name: count, Length: 242, dtype: int64

In [33]:
(df["total_sqft"]/df['bhk']).describe()

count    13274.000000
mean       579.731736
std        392.246056
min          0.250000
25%        475.000000
50%        554.000000
75%        627.500000
max      26136.000000
dtype: float64

In [34]:
df=  df[((df["total_sqft"]/df['bhk'])>=350)]

In [35]:
df

,location,size,total_sqft,bath,price,bhk,price per sqr feet
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
...,...,...,...,...,...,...,...
13315,Whitefield,5 Bedroom,3453.0,4.0,231.00,5,6689.834926
13316,others,4 BHK,3600.0,5.0,400.00,4,11111.111111
13317,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.00,2,5258.545136
13318,Padmanabhanagar,4 BHK,4689.0,4.0,488.00,4,10407.336319
13319,Doddathoguru,1 BHK,550.0,1.0,17.00,1,3090.909091

In [36]:
df.shape

(12181, 7)

In [37]:
df["price per sqr feet"].describe()

count     12181.000000
mean       6154.152507
std        4022.908444
min         267.829813
25%        4166.666667
50%        5238.319962
75%        6781.429317
max      176470.588235
Name: price per sqr feet, dtype: float64

In [ ]:
def outlier_remover_bhk(df):
    exclude_indices = []  # Use list instead of NumPy array for efficiency
    for location, location_df in df.groupby("location"):
        bhk_stats = {}
        
        # Compute statistics for each BHK in the location
        for bhk, bhk_df in location_df.groupby("bhk"):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df['price per sqr feet']),
                'std': np.std(bhk_df['price per sqr feet']),  # Corrected std
                'count': len(bhk_df)  # Corrected count
            }
        
        # Identify outliers based on bhk-1 statistics
        for bhk, bhk_df in location_df.groupby("bhk"):
            stats = bhk_stats.get(bhk - 1)
            if stats and stats['count'] > 5:
                exclude_indices.extend(bhk_df[bhk_df['price per sqr feet'] < stats['mean']].index.values)
    
    return df.drop(exclude_indices, axis='index')

In [51]:
df = outlier_remover_bhk(df)

In [66]:
def remove_outlier_sqrt(df):
    df_output = pd.DataFrame()  # Empty dataframe to store filtered data
    
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf['price per sqr feet'])  # Calculate mean
        st = np.std(subdf['price per sqr feet'])  # Calculate standard deviation

        # Filter out outliers within one standard deviation of the mean
        gen_df = subdf[(subdf['price per sqr feet'] > (m - st)) & 
                       (subdf['price per sqr feet'] <= (m + st))]
        
        df_output = pd.concat([df_output, gen_df], ignore_index=True)  # Corrected concatenation

    return df_output

In [53]:
df = remove_outlier_sqrt(df)

In [55]:
df.describe()

         total_sqft        price          bhk  price per sqr feet
count   6791.000000  6791.000000  6791.000000         6791.000000
mean    1529.812484   107.529221     2.508320         6379.391006
std      824.244312   111.686756     0.899622         2763.013036
min      350.000000    10.000000     1.000000         1875.000000
25%     1107.000000    52.000000     2.000000         4677.043011
50%     1295.000000    75.000000     2.000000         5795.387345
75%     1710.000000   120.000000     3.000000         7084.181666
max    12000.000000  2200.000000    16.000000        24509.803922

In [56]:
df.shape

(6791, 7)

In [58]:
df.drop(columns=['price per sqr feet','size'])

                 location  total_sqft bath  price  bhk
0     1st Block Jayanagar      2850.0  4.0  428.0    4
1     1st Block Jayanagar      1630.0  3.0  194.0    3
2     1st Block Jayanagar      1875.0  2.0  235.0    3
3     1st Block Jayanagar      1200.0  2.0  130.0    3
4     1st Block Jayanagar      1235.0  2.0  148.0    2
...                   ...         ...  ...    ...  ...
6786               others      2000.0  2.0  360.0    3
6787               others      1140.0  1.0  185.0    2
6788               others      1353.0  2.0  110.0    2
6789               others       812.0  1.0   26.0    1
6790               others      3600.0  5.0  400.0    4

[6791 rows x 5 columns]

In [59]:
df.to_csv("Cleaned_data.csv")

In [61]:
x = df.drop(columns=['price'])
y=df['price']

In [62]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import Lasso , ridge_regression
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [63]:
x_train , x_test , y_train , y_test = train_test_split(x,y , test_size=0.3, random_state=0)

In [65]:
print(x_train.shape)
print(x_test.shape)

(4753, 6)
(2038, 6)